[RustyCounter_UI]
strKilled="Killed:"
strActive="Active:"
strTotal="Total:"
strRemaining="Remaining:"

;=================================================================

[UISL_Shell_RustyTacCounter]
strMessage_Title = "[WOTC] Tactical Kill Counter Redux"
strMessage_Header = "WARNING: Config File Has Been Reset!"
strMessage_Body = "The config file for <font color='#53B45E'>[WOTC] Tactical Kill Counter Redux</font> has been created new or updated.<br/><br/>If this is the first time setup you will need to restart XCOM2 or else it will crash!<br/><br/>You will need to check any previous values you had in MCM for the values to take effect."
strDismiss_Button = "OK"

;=================================================================
[RustyCounter_Settings]
Group1_Label = "General Settings"

alwaysShowActiveEnemyCount_Label = "Always Show Active Enemy Count"
alwaysShowActiveEnemyCount_Tooltip = "If set to false, the total active enemy count is never shown."

showSplitTeamsActive_Label = "Show Split Teams Active"
showSplitTeamsActive_Tooltip = "Some people like it this way, some the other. Set it to false and you'll get one total number, set it to true and you'll get a split per team count. No Color mode forces combined total."

showSplitTeamsKilled_Label = "Show Split Teams Killed"
showSplitTeamsKilled_Tooltip = "Some people like it this way, some the other. Set it to false and you'll get one total number, set it to true and you'll get a split per team count. No Color mode forces combined total."

neverShowEnemyTotal_Label = "Never Show Enemy Total"
neverShowEnemyTotal_Tooltip = "Setting this to true will NEVER show you the total or remaining number of enemies in a mission, even when you have no access to the information."

alwaysShowEnemyTotal_Label = "Always Show Enemy Total"
alwaysShowEnemyTotal_Tooltip = "The exact reverse of the above - set it to true and you'll get the enemies total or remaining ALWAYS even though you have not built the Shadow Chamber yet. Please note that this overrides the 'never' setting from above - this one takes precedence, 'ALWAYS'."

locationScoutShowsTotal_Label = "Show Total if Location Scout is active"
locationScoutShowsTotal_Tooltip = "Set it to true and you'll get the total or remaining even if you have not built the Shadow Chamber yet, as long as the Location Scout sitrep is active."

showRemainingInsteadOfTotal_Label = "Show Remaining Instead Of Total"
showRemainingInsteadOfTotal_Tooltip = "Some people like it this way, some the other. Set it to false and you'll get the total count of enemies, set it to true and you'll get the remaining count."

includeTurrets_Label = "Include Turrets"
includeTurrets_Tooltip = "As turrets don't count into the 'total killed' at the end of the mission, we don't include them here as well by default. If you like, you can enable counting them."

showXCOMcounts_Label = "Include XCOM"
showXCOMcounts_Tooltip = "If Show Split Teams is displayed include a count of XCOM units"

;================================
Group2_Label = "UI Settings"

noColor_Label = "No Color"
noColor_Tooltip = "Disable coloring of all numbers. Forces combined total of split counts."

textAlignment_Label = "Text Alignment"
textAlignment_Tooltip = "How the text is aligned witin the 'box'."

autoAdjust_Label = "Auto Adjust For Timer"
autoAdjust_Tooltip = "Adjust the Y Offest if a timer and/or evac countdown is shown."

BoxAnchor_Label = "Box Anchor"
BoxAnchor_Tooltip = "Where the 'box' (which holds the text) is anchored on the screen (the whole screen).\nPossible values (straight from UIUtilities):\n0 (ANCHOR_NONE)\n1 (ANCHOR_TOP_LEFT)\n2 (ANCHOR_TOP_CENTER)\n3 (ANCHOR_TOP_RIGHT)\n4 (ANCHOR_MIDDLE_LEFT)\n5 (ANCHOR_MIDDLE_CENTER)\n6 (ANCHOR_MIDDLE_RIGHT)\n7 (ANCHOR_BOTTOM_LEFT)\n8 (ANCHOR_BOTTOM_CENTER)\n9 (ANCHOR_BOTTOM_RIGHT)"

OffsetX_Label = "OffsetX"
OffsetX_Tooltip = "By how much the 'box' should be offset from its anchor on the X axis, horizontal."

OffsetY_Label = "OffsetY"
OffsetY_Tooltip = "By how much the 'box' should be offset from its anchor on the Y axis, vertical."
